load-testing/artillery.yml
config:
  target: "http://localhost:9000"
  phases:
    - duration: 1 # duration new users are ariving
      arrivalRate: 2 # users each second, each user creates all the defined requests
  processor: "./index.js" # path to the configuration of your easygraphql-load-tester
  defaults:
    headers:
      "Content-Type": "application/json"
scenarios:
  - name: "GraphQL Query load test"
    flow:
      - function: "runQueries" # function defined in your easygraphql-load-tester configuration
      - loop:
          - post:
              url: "/graphql"
              json:
                query: "{{ $loopElement.query }}"
                variables: "{{ $loopElement.variables }}"
          - log: "----------------------------------"
          - log: "Sent a request to the {{ $loopElement.operation }}: {{ $loopElement.name }}"
          - log: "And variables {{ $loopElement.variables }}"
        over: cases